# 1266. Minimum Time Visiting All Points
'''
对相邻两个点，他们的最短距离就是横坐标差/纵坐标差里面较大的那一个。
遍历points数组，累加得到最终结果
'''

from typing import List


class Solution:
    def minTimeToVisitAllPoints(self, points: List[List[int]]) -> int:
        output = 0
        for i in range(len(points) - 1):
            distance_x = points[i][0] - points[i + 1][0]
            distance_y = points[i][1] - points[i + 1][1]
            output += max(abs(distance_x), abs(distance_y))
        return output


# # test
# sol = Solution()
# ans = sol.minTimeToVisitAllPoints([[559,511],[932,618],[-623,-443],[431,91],[838,-127],[773,-917],[-500,-910],[830,-417],[-870,73],[-864,-600],[450,535],[-479,-370],[856,573],[-549,369],[529,-462],[-839,-856],[-515,-447],[652,197],[-83,345],[-69,423],[310,-737],[78,-201],[443,958],[-311,988],[-477,30],[-376,-153],[-272,451],[322,-125],[-114,-214],[495,33],[371,-533],[-393,-224],[-405,-633],[-693,297],[504,210],[-427,-231],[315,27],[991,322],[811,-746],[252,373],[-737,-867],[-137,130],[507,380],[100,-638],[-296,700],[341,671],[-944,982],[937,-440],[40,-929],[-334,60],[-722,-92],[-35,-852],[25,-495],[185,671],[149,-452]])
# print(ans)
